---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationOutOfSizeCondition
source: html/85ef6496-b0a7-a54f-407b-2fc243485f8c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationOutOfSizeCondition Property

The fabrication part size is not within the correct size range for the service button condition.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationOutOfSizeCondition { get; }
```